Benchmark-Limitations/limitations/time-limited/monte_carlo_artillery.yaml
# limitations/call-limited/monte_carlo_artillery.yaml
config:
  phases:
    - duration: __DURATION__
      arrivalRate: __ARRIVALRATE__

scenarios:
  - flow:
      - post:
          url: "{{ target }}"
          json:
            trials: __INPUT__
          capture:
            - json: "$.uniqueId"
              as: uniqueId
            - json: "$.estimatedPi"
              as: estimatedPi
            - json: "$.trials"
              as: trials
            - json: "$.markColdStart"
              as: coldStart
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - log: |
          Unique ID: {{ uniqueId }},
          Pi: {{ estimatedPi }},
          Input: {{ trials }},
          Cold Start: {{ coldStart }}
    name: "Monte-Carlo"